### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [1]:
# Dependencies and Setup
import pandas as pd

# File to Load (Remember to Change These)
school_data_to_load = "C:/Users/audre/OneDrive/Documents/BOOTCAMP/PANDAS/HOMEWORK/PyCitySchools_schools_complete.csv"
student_data_to_load = "C:/Users/audre/OneDrive/Documents/BOOTCAMP/PANDAS/HOMEWORK/PyCitySchools_students_complete.csv"

# Read School and Student Data File and store into Pandas DataFrames
school_data = pd.read_csv(school_data_to_load)
student_data = pd.read_csv(student_data_to_load)

school_data.head()

   School ID            school_name      type  size   budget
0          0      Huang High School  District  2917  1910635
1          1   Figueroa High School  District  2949  1884411
2          2    Shelton High School   Charter  1761  1056600
3          3  Hernandez High School  District  4635  3022020
4          4    Griffin High School   Charter  1468   917500

In [2]:
student_data.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

In [3]:
# Combine the data into a single dataset.  
school_data_complete = pd.merge(student_data, school_data, how="left", on=["school_name", "school_name"])
school_data_complete.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635

## District Summary

* Calculate the total number of schools

* Calculate the total number of students

* Calculate the total budget

* Calculate the average math score 

* Calculate the average reading score

* Calculate the percentage of students with a passing math score (70 or greater)

* Calculate the percentage of students with a passing reading score (70 or greater)

* Calculate the percentage of students who passed math **and** reading (% Overall Passing)

* Create a dataframe to hold the above results

* Optional: give the displayed data cleaner formatting

In [27]:
student_info = {}

In [30]:
school_count = school_data['School ID'].count()
student_info ['school_count'] = school_count
school_count

15

In [5]:
student_count = student_data['Student ID'].count()
student_info ['student_count'] = student_count
student_count

39170

In [6]:
data_of_students = student_data['Student ID'].value_counts()
student_info ['data_of_students'] = data_of_students
student_data['Student ID'].value_counts()

2047     1
27975    1
9550     1
15693    1
13644    1
        ..
21151    1
23198    1
17053    1
19100    1
0        1
Name: Student ID, Length: 39170, dtype: int64

In [7]:
school_data['School ID'].value_counts()

14    1
13    1
12    1
11    1
10    1
9     1
8     1
7     1
6     1
5     1
4     1
3     1
2     1
1     1
0     1
Name: School ID, dtype: int64

In [8]:
total_budget = school_data['budget'].sum()

In [9]:
average_math_score = student_data['math_score'].mean()

In [10]:
average_reading_score = student_data['reading_score'].mean()

In [13]:
passing_student_count_math = student_data.loc [student_data['math_score'] >= 70, :]['Student ID'].count()
passing_percentage_math = passing_student_count_math/student_count*100
passing_percentage_math

74.9808526933878

In [15]:
#Calculate the percentage of students with a passing reading score (70 or greater)
passing_student_count_reading = student_data.loc [student_data['reading_score'] >= 70, :]['Student ID'].count()
passing_percentage_reading = passing_student_count_reading/student_count*100
passing_percentage_reading

85.80546336482001

In [25]:
#Calculate the percentage of students who passed math and reading (% Overall Passing)
passing_student_count_total = student_data.loc[(student_data['math_score'] >= 70)& (student_data['reading_score'] >= 70), ['Student ID']].count()
passing_percentage_overall = passing_student_count_total/student_count*100
passing_percentage_overall[0]

65.17232575950983

In [41]:
#Create a dataframe to hold the above results
passing_student_count_total = student_data.loc[(student_data['math_score'] >= 70) & (student_data['reading_score'] >= 70), ['student_name', 'Student ID']]
passing_student_count_total

          student_name  Student ID
4           Bonnie Ray           4
5        Bryan Miranda           5
6        Sheena Carter           6
8         Michael Roth           8
9       Matthew Greene           9
...                ...         ...
39165     Donna Howard       39165
39166        Dawn Bell       39166
39167   Rebecca Tanner       39167
39168     Desiree Kidd       39168
39169  Carolyn Jackson       39169

[25528 rows x 2 columns]

## School Summary

* Create an overview table that summarizes key metrics about each school, including:
  * School Name
  * School Type
  * Total Students
  * Total School Budget
  * Per Student Budget
  * Average Math Score
  * Average Reading Score
  * % Passing Math
  * % Passing Reading
  * % Overall Passing (The percentage of students that passed math **and** reading.)
  
* Create a dataframe to hold the above results

In [49]:
summary_school_data = school_data_complete['school_name'].unique()
summary_school_data = pd.DataFrame({'school_name':summary_school_data})
summary_school_data

              school_name
0       Huang High School
1    Figueroa High School
2     Shelton High School
3   Hernandez High School
4     Griffin High School
5      Wilson High School
6     Cabrera High School
7      Bailey High School
8      Holden High School
9        Pena High School
10     Wright High School
11  Rodriguez High School
12    Johnson High School
13       Ford High School
14     Thomas High School

In [44]:
# school_data[]
total_students = school_data_complete.groupby('school_name')['Student ID'].count()
total_students

school_name
Bailey High School       4976
Cabrera High School      1858
Figueroa High School     2949
Ford High School         2739
Griffin High School      1468
Hernandez High School    4635
Holden High School        427
Huang High School        2917
Johnson High School      4761
Pena High School          962
Rodriguez High School    3999
Shelton High School      1761
Thomas High School       1635
Wilson High School       2283
Wright High School       1800
Name: Student ID, dtype: int64

## Top Performing Schools (By % Overall Passing)

* Sort and display the top five performing schools by % overall passing.

## Bottom Performing Schools (By % Overall Passing)

* Sort and display the five worst-performing schools by % overall passing.

## Math Scores by Grade

* Create a table that lists the average Reading Score for students of each grade level (9th, 10th, 11th, 12th) at each school.

  * Create a pandas series for each grade. Hint: use a conditional statement.
  
  * Group each series by school
  
  * Combine the series into a dataframe
  
  * Optional: give the displayed data cleaner formatting

## Reading Score by Grade

* Perform the same operations as above for reading scores

## Scores by School Spending

* Create a table that breaks down school performances based on average Spending Ranges (Per Student). Use 4 reasonable bins to group school spending. Include in the table each of the following:
  * Average Math Score
  * Average Reading Score
  * % Passing Math
  * % Passing Reading
  * Overall Passing Rate (Average of the above two)

## Scores by School Size

* Perform the same operations as above, based on school size.

## Scores by School Type

* Perform the same operations as above, based on school type